# Manipulação de Dados Ausentes

In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame({"A": [1, 2, np.nan], "B": [5, np.nan, np.nan], "C": [1, 2, 3]})

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [20]:
df.dropna(
    axis=1,
    thresh=2,
)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [21]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [ ]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [31]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3